[
  {
    "audience": "Executive",
    "framing": "Two-speed gives you immediate ROI and a durable moat. Lighthouse wins in weeks, then we codify them into products your whole portfolio can use.",
    "bullets": [
      "Fast time-to-value: 2–4 week pilots with measurable KPIs.",
      "Risk-managed investment: productize only validated patterns.",
      "Scale efficiencies: one codebase, many sites.",
      "Margin expansion: services → subscriptions over time."
    ],
    "example": "E.g., predictive maintenance saved AED X at one plant in 4 weeks; in 12 weeks it became a product used by 10 sites."
  },
  {
    "audience": "Technical",
    "framing": "We prototype quickly, then refactor into modular, testable, reusable components. We embrace tech debt consciously at G0 and pay it down at G2.",
    "bullets": [
      "Dual-track: explore (solutions) vs exploit (product).",
      "Pattern extraction: shared libs, services, feature stores.",
      "CI/CD, IaC, MLOps in product stage.",
      "Integration playbooks and reference adapters."
    ],
    "example": "The one-off ETL becomes a reusable connector; the PoC model becomes a versioned service with monitoring."
  },
  {
    "audience": "Client",
    "framing": "We solve your problem now and ensure it keeps getting better. Your pilot becomes the blueprint for a robust, supported product.",
    "bullets": [
      "Your pain point first: custom fit, minimal disruption.",
      "No dead-ends: pilots migrate into supported products.",
      "You influence the roadmap as a lighthouse user.",
      "Lower total cost than bespoke systems per site."
    ],
    "example": "Your ER dashboard goes live in 4 weeks; by quarter’s end it’s an enterprise tool with SSO and support."
  },
  {
    "audience": "Investor",
    "framing": "Capital-efficient growth: services revenue funds product R&D. Mix shifts to high-margin recurring revenue after G2–G3.",
    "bullets": [
      "Validated demand pre-product.",
      "Lower CAC via embedded solution relationships.",
      "High GM on subscriptions (70–80%).",
      "Multiple product lines de-risk the portfolio."
    ],
    "example": "3 solution wins → one product with 10 customers in 2 quarters; GM rises from 40% to 70%+."
  }
]